In [1]:
import pandas as pd

df =pd.read_csv('C:\\Users\\Nikhil Gupta\\ML_Pandas\\student_results.csv')
df

In [3]:
df =pd.read_csv('C:\\Users\\Nikhil Gupta\\ML_Pandas\\student_results.csv')
df

   Student    ID  Class  Study  Sleep  Social Media  Gaming  Percentage Passed
0        1  1001     10    2.0      9             3     4.0          50     No
1        2  1002     10    6.0      8             2     6.0          80    Yes
2        3  1003     10    3.0      8             2     NaN          60     No
3        4  1004     11    NaN     10             4     5.0          70    Yes
4        5  1005     11    4.0      7             8     7.0          78    Yes
5        6  1006     11   10.0      8             3     2.0          90    Yes
6        7  1007     12    4.0      6             4     6.0          79    Yes

In [6]:
gr1=df.groupby('Class')
gr1

In [7]:
gr1.groups

{10: [0, 1, 2], 11: [3, 4, 5], 12: [6]}

In [8]:
len(df)

7

In [9]:
len(gr1)

3

In [10]:
gr1.size()

Class
10    3
11    3
12    1
dtype: int64

In [11]:
gr1.first()

       Student    ID  Study  Sleep  Social Media  Gaming  Percentage Passed
Class
10           1  1001    2.0      9             3     4.0          50     No
11           4  1004    4.0     10             4     5.0          70    Yes
12           7  1007    4.0      6             4     6.0          79    Yes

In [12]:
gr1.last()

       Student    ID  Study  Sleep  Social Media  Gaming  Percentage Passed
Class
10           3  1003    3.0      8             2     6.0          60     No
11           6  1006   10.0      8             3     2.0          90    Yes
12           7  1007    4.0      6             4     6.0          79    Yes

In [13]:
gr1.groups

{10: [0, 1, 2], 11: [3, 4, 5], 12: [6]}

In [14]:
gr1.get_group(11)

   Student    ID  Class  Study  Sleep  Social Media  Gaming  Percentage Passed
3        4  1004     11    NaN     10             4     5.0          70    Yes
4        5  1005     11    4.0      7             8     7.0          78    Yes
5        6  1006     11   10.0      8             3     2.0          90    Yes

In [16]:
gr1.get_group(11).shape

(3, 9)

In [17]:
gr1.sum()

C:\Users\Nikhil Gupta\AppData\Local\Temp\ipykernel_15812\2871856081.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  gr1.sum()

       Student    ID  Study  Sleep  Social Media  Gaming  Percentage
Class
10           6  3006   11.0     25             7    10.0         190
11          15  3015   14.0     25            15    14.0         238
12           7  1007    4.0      6             4     6.0          79

In [18]:
gr1.mean()

C:\Users\Nikhil Gupta\AppData\Local\Temp\ipykernel_15812\1587183179.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  gr1.mean()

       Student      ID     Study     Sleep  Social Media    Gaming  Percentage
Class
10         2.0  1002.0  3.666667  8.333333      2.333333  5.000000   63.333333
11         5.0  1005.0  7.000000  8.333333      5.000000  4.666667   79.333333
12         7.0  1007.0  4.000000  6.000000      4.000000  6.000000   79.000000

In [19]:
gr1['ID'].mean()

Class
10    1002.0
11    1005.0
12    1007.0
Name: ID, dtype: float64

In [20]:
gr1['ID'].mean().sort_values(ascending =False)

Class
12    1007.0
11    1005.0
10    1002.0
Name: ID, dtype: float64